//
//  Homework3Text.swift
//  Homework3
//
//  Created by Дмитрий Ильичёв on 15.08.2022.
//

import Foundation

/*
 1. Откройте презентацию по протоколам, в конце вы найдете блок с практикой.
 Выполните практику, создав простую игровую ситуацию с помощью протоколов.
 
 2. Лучший способ закрепить информацию, придумать свой способ применения
 протоколов.
 
 Откройте последний слайд практики по протоколам, и выполните задание. Необходимо
 создать свою мини игру, где вы могли бы использовать протоколы, но будет
 минимальный набор требований:
 
 ○ Должны быть функции, возвращающие опциональные значения
 ○ Эти функции должны вызываться и опционалы должны быть “развернуты”
 ○ Перенесите эту игру в XCode проект
 
 Организуйте красивую файловую структуру, разные типы в разные файлы. Используйте
 папки. Этот проект мы будем загружать на github в качестве домашнего задания в
 следующем блоке
 
 3. Напишите расширения на следующие типы:
 
 ○ Int - Функция возводит число в N-ую степень. Попробуйте решить задачу без
 использования стандартной функции pow(), решите ее с использованием циклов
 ○ String - Вычисляемое свойство isPalindrome. Возвращает Bool, в зависимости от
 того является ли строка палиндромом.
 
 * Не забывайте, что вы можете искать информацию в интернете
 Протестируйте новые расширения c разными данными, используйте не менее трех
 тестов на каждый тип, которые максимально отличаются между собой
 
 4. Вернитесь к созданной вами игре во втором задании и добавьте для всех
 протоколов реализацию методов по умолчанию. 
 
 Откройте презентацию по Generics, в конце презентации вы найдете практику
 5. Выполните практику на первом слайде.
 
 6. Выполните практику второго слайда. Здесь вы можете реализовать либо стек, либо
 связанный список (stack / linked list)
 Задачи сложнее чем кажутся. Не забывайте, что вы можете искать информацию в
 интернете (информацию, но не решения ;)
 */
